Autodesk.Revit.DB.Lighting.LightGroupManager.SetLightDimmer(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Sets the dimmer value for the given light for rendering the given view
Remarks:
The dimmer value is in the range [0.0, 1.0] with 0.0 being totally dimmed and 1.0 being totally on
viewId:
The Id of the view
lightId:
The Id of the light to turn on or off
dimmingValue:
The dimmer value to set int the range of [0.0, 1.0]
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light instance
-or-
The given dimming value is not in the range [0.0, 1.0]
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.GetLightDimmer(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Gets the dimmer value for the given light for rendering the given view
Remarks:
The dimmer value is in the range [0.0, 1.0] with 0.0 being totally dimmed and 1.0 being totally on
viewId:
The Id of the view
lightId:
The Id of the light to turn on or off
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light instance
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.SetLightOn(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Turns the given light on or off for rendering the given view depending on the bool argument
viewId:
The Id of the view
lightId:
The Id of the light to turn on or off
turnOn:
Turns the light on if true, off if false
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light instance
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.IsLightOn(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Returns true if the given light is on for rendering the given view
viewId:
The Id of the view
lightId:
The Id of the light
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light instance
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.SetLightGroupOn(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Turns the given light group on or off for rendering the given view depending on the bool argument
viewId:
The Id of the view
groupId:
The Id of the light group
turnOn:
Turns the light group on if true, off if false
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light group
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.IsLightGroupOn(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Returns true if the given light group is on
viewId:
The Id of the view
groupId:
The Id of the light group
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a 3d view
-or-
The given element Id does not correspond to a light group
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.GetGroups
Get the set of contained LightGroup objects
The set of LightGroup objects
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.DeleteGroup(Autodesk.Revit.DB.ElementId)
Remove the given LightGroup object from the set of LightGroup objects
Remarks:
Note that only the group is deleted, not the lights contained in the group
The lights will still exist but will not be in a group any longer
groupId:
The Id of the LightGroup object to remove
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element Id does not correspond to a light group
-or-
The LightGroup is not contained by this LightGroupManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.CreateGroup(System.String)
Create a new LightGroup object with the given name
name:
The name to use for the new LightGroup object
Returns:
The new LightGroup object that was created
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name is not valid because it is not unique within this LightGroupManager
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.GetLightGroupManager(Autodesk.Revit.DB.Document)
Creates a light group manager object from the given document
document:
The document the manager is from
Returns:
The newly created Light group manager object
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is not valid because it is not a project (rvt) document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroupManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.LightGroupManager
This class represents a set of light groups that are used for easier management of various lighting scenarios
Since:
2013